# print()ফাংশনটি প্রায়শই ভেরিয়েবল আউটপুট করতে ব্যবহৃত হয়।
# উদাহরণ:
x = "Python is awesome"
print(x)

# ফাংশনটির ভেতরে print(), আপনি কমা দিয়ে আলাদা করে একাধিক ভেরিয়েবল আউটপুট করেন:
# উদাহরণ:
x = "Python"
y = "is"
z = "awesome"
print(x, y, z)

# আপনি +অপারেটরটি ব্যবহার করে একাধিক ভেরিয়েবল আউটপুট করতেও পারেন:
# উদাহরণ:
x = "Python "
y = "is "
z = "awesome"
print(x + y + z)

# "Python "লক্ষ্য করুন, ` ` এবং ` ` এর পরে একটি স্পেস রয়েছে। "is "এগুলো ছাড়া ফলাফল হতো "Pythonisawesome"।

# সংখ্যার ক্ষেত্রে, এই +চিহ্নটি একটি গাণিতিক অপারেটর হিসেবে কাজ করে:
# উদাহরণ:
x = 5
y = 10
print(x + y)

# ফাংশনের মধ্যে print(), যখন আপনি + অপারেটর ব্যবহার করে একটি স্ট্রিং এবং একটি সংখ্যা একত্রিত করার চেষ্টা করবেন, তখন পাইথন একটি ত্রুটি দেখাবে:
# উদাহরণ
x = 5
y = "John"
print(x + y)

# ফাংশনের মধ্যে একাধিক ভেরিয়েবল আউটপুট করার সবচেয়ে ভালো উপায় print()হলো সেগুলোকে কমা দিয়ে আলাদা করা, যা বিভিন্ন ডেটা টাইপও সমর্থন করে:
# উদাহরণ
x = 5
y = "John"
print(x, y)

