# যেসব ভেরিয়েবল কোনো ফাংশনের বাইরে তৈরি করা হয় (যেমনটা আগের পৃষ্ঠাগুলোর সব উদাহরণে দেখানো হয়েছে), সেগুলোকে গ্লোবাল ভেরিয়েবল বলা হয়।

# গ্লোবাল ভেরিয়েবল ফাংশনের ভেতরে এবং বাইরে, উভয় স্থানেই সবাই ব্যবহার করতে পারে।

# উদাহরণ:
# ফাংশনের বাইরে একটি ভেরিয়েবল তৈরি করুন এবং ফাংশনের ভিতরে সেটি ব্যবহার করুন।

x = "awesome"

def myfunc():
  print("Python is " + x)

myfunc()

# যদি আপনি কোনো ফাংশনের ভেতরে একই নামের একটি ভেরিয়েবল তৈরি করেন, তাহলে এই ভেরিয়েবলটি লোকাল হবে এবং শুধুমাত্র ওই ফাংশনের ভেতরেই ব্যবহার করা যাবে। একই নামের গ্লোবাল ভেরিয়েবলটি যেমন ছিল তেমনই থাকবে, অর্থাৎ গ্লোবাল এবং তার আসল মানসহ।

# উদাহরণ: 
# ফাংশনের ভিতরে গ্লোবাল ভেরিয়েবলের নামে একটি ভেরিয়েবল তৈরি করুন।

x = "awesome"

def myfunc():
  x = "fantastic"
  print("Python is " + x)

myfunc()

print("Python is " + x)

# বৈশ্বিক কীওয়ার্ড
# সাধারণত, যখন আপনি কোনো ফাংশনের ভেতরে একটি ভেরিয়েবল তৈরি করেন, তখন সেই ভেরিয়েবলটি লোকাল হয় এবং শুধুমাত্র সেই ফাংশনের ভেতরেই ব্যবহার করা যায়।

# ফাংশনের ভিতরে গ্লোবাল ভেরিয়েবল তৈরি করতে আপনি ` global#` কীওয়ার্ডটি ব্যবহার করতে পারেন।

# উদাহরণ:
# যদি আপনি globalকীওয়ার্ডটি ব্যবহার করেন, তাহলে ভেরিয়েবলটি গ্লোবাল স্কোপের অন্তর্ভুক্ত হয়:

def myfunc():
  global x
  x = "fantastic"

myfunc()

print("Python is " + x)

# এছাড়াও, globalকোনো ফাংশনের ভেতরে গ্লোবাল ভেরিয়েবল পরিবর্তন করতে চাইলে কীওয়ার্ডটি ব্যবহার করুন।

# উদাহরণ:
# ফাংশনের ভিতরে কোনো গ্লোবাল ভেরিয়েবলের মান পরিবর্তন করতে, `#` কীওয়ার্ডটি ব্যবহার করে ভেরিয়েবলটিকে উল্লেখ করুন global:

x = "awesome"

def myfunc():
  global x
  x = "fantastic"

myfunc()

print("Python is " + x)

