# ভেরিয়েবলের ধরণ নির্দিষ্ট করুন
""" কখনও কখনও আপনি কোনো ভেরিয়েবলের টাইপ নির্দিষ্ট করে দিতে চাইতে পারেন। কাস্টিং (casting) ব্যবহার করে এটি করা যায়। পাইথন একটি অবজেক্ট-ওরিয়েন্টেড ভাষা, এবং সেই হিসেবে এটি তার প্রিমিটিভ টাইপগুলোসহ ডেটা টাইপ সংজ্ঞায়িত করতে ক্লাস ব্যবহার করে। """

# তাই পাইথনে কাস্টিং কনস্ট্রাক্টর ফাংশন ব্যবহার করে করা হয়:

"""
int() - একটি ইন্টিজার লিটারেল, একটি ফ্লোট লিটারেল (সমস্ত দশমিক বাদ দিয়ে), অথবা একটি স্ট্রিং লিটারেল (যদি স্ট্রিংটি একটি পূর্ণ সংখ্যা হয়) থেকে একটি পূর্ণ সংখ্যা তৈরি করে।
float() - একটি ইন্টিজার লিটারেল, একটি ফ্লোট লিটারেল বা একটি স্ট্রিং লিটারেল থেকে একটি ফ্লোট সংখ্যা তৈরি করে (শর্ত থাকে যে স্ট্রিংটি একটি ফ্লোট বা ইন্টিজার)।
str() - স্ট্রিং, ইন্টিজার লিটারেল এবং ফ্লোট লিটারেল সহ বিভিন্ন ধরণের ডেটা টাইপ থেকে একটি স্ট্রিং তৈরি করে।
"""

# 1. উদাহরণ:
# পূর্ণসংখ্যা:
x = int(1)   # x will be 1
y = int(2.8) # y will be 2
z = int("3") # z will be 3

# 2. উদাহরণ:
# ভাসমান বস্তু:
x = float(1)     # x will be 1.0
y = float(2.8)   # y will be 2.8
z = float("3")   # z will be 3.0
w = float("4.2") # w will be 4.2

# 3.উদাহরণ:
# স্ট্রিং:
x = str("s1") # x will be 's1'
y = str(2)    # y will be '2'
z = str(3.0)  # z will be '3.0'
