# স্ট্রিং:
# পাইথনে স্ট্রিং হয় একক উদ্ধৃতি চিহ্ন, অথবা দ্বৈত উদ্ধৃতি চিহ্ন দিয়ে আবদ্ধ থাকে।
# 'hello' এবং "hello" একই ।
# আপনি এই ফাংশনটি ব্যবহার করে একটি স্ট্রিং লিটারেল প্রদর্শন করতে পারেন print():

# উদাহরণ:
print("Hello")
print('Hello')

# উদ্ধৃতির ভিতরে উদ্ধৃতি
# আপনি একটি স্ট্রিংয়ের ভিতরে উদ্ধৃতি চিহ্ন ব্যবহার করতে পারেন, তবে শর্ত হলো সেগুলি যেন স্ট্রিংটিকে ঘিরে থাকা উদ্ধৃতি চিহ্নের সাথে না মেলে।

# উদাহরণ:
print("It's alright")
print("He is called 'Johnny'")
print('He is called "Johnny"')

# একটি ভেরিয়েবলে স্ট্রিং অ্যাসাইন করুন
# কোনো ভেরিয়েবলে স্ট্রিং অ্যাসাইন করতে হলে, প্রথমে ভেরিয়েবলের নাম, তারপর একটি সমান চিহ্ন এবং শেষে স্ট্রিংটি লিখতে হয়:

# উদাহরণ:
a = "Hello"
print(a)

# মাল্টিলাইন স্ট্রিং
# আপনি তিনটি উদ্ধৃতি চিহ্ন ব্যবহার করে একটি ভেরিয়েবলে একাধিক লাইনের স্ট্রিং অ্যাসাইন করতে পারেন:

# উদাহরণ:
# আপনি তিনটি ডাবল কোট ব্যবহার করতে পারেন:
a = """Lorem ipsum dolor sit amet,
consectetur adipiscing elit,
sed do eiusmod tempor incididunt
ut labore et dolore magna aliqua."""
print(a)

# অথবা তিনটি একক উদ্ধৃতি চিহ্ন:
# উদাহরণ:
a = '''Lorem ipsum dolor sit amet,
consectetur adipiscing elit,
sed do eiusmod tempor incididunt
ut labore et dolore magna aliqua.'''
print(a)

# স্ট্রিংগুলি অ্যারে
# অন্যান্য অনেক জনপ্রিয় প্রোগ্রামিং ভাষার মতো, পাইথনেও স্ট্রিং হলো ইউনিকোড অক্ষরের অ্যারে।
# তবে, পাইথনে ক্যারেক্টার ডেটা টাইপ নেই, একটি একক ক্যারেক্টার হলো কেবল ১ দৈর্ঘ্যের একটি স্ট্রিং।
# স্ট্রিং-এর উপাদানগুলো অ্যাক্সেস করার জন্য স্কয়ার ব্র্যাকেট ব্যবহার করা যায়।

# উদাহরণ:
# ১ নং অবস্থানে থাকা অক্ষরটি নিন (মনে রাখবেন যে প্রথম অক্ষরটির অবস্থান ০):
a = "Hello, World!"
print(a[1])

# একটি স্ট্রিং এর মাধ্যমে লুপ
# for যেহেতু স্ট্রিংগুলো অ্যারে, তাই আমরা একটি লুপ ব্যবহার করে এর ভেতরের অক্ষরগুলোর মধ্যে দিয়ে যেতে পারি ।

# উদাহরণ:
# 'banana' শব্দটির অক্ষরগুলো দিয়ে চক্রাকারে ঘুরুন:
for x in "banana":
  print(x)


# স্ট্রিংয়ের দৈর্ঘ্য
# কোনো স্ট্রিংয়ের দৈর্ঘ্য বের করতে len()ফাংশনটি ব্যবহার করুন।

# উদাহরণ:
# ফাংশনটি len()একটি স্ট্রিংয়ের দৈর্ঘ্য রিটার্ন করে:
a = "Hello, World!"
print(len(a))

# চেক স্ট্রিং
# কোনো স্ট্রিং-এ কোনো নির্দিষ্ট শব্দগুচ্ছ বা অক্ষর আছে কি না, তা যাচাই করতে আমরা `set` কীওয়ার্ডটি ব্যবহার করতে পারি in।

# উদাহরণ:
# নিচের লেখাটিতে "free" শব্দটি আছে কিনা তা পরীক্ষা করুন:
txt = "The best things in life are free!"
print("free" in txt)

# একটি if বিবৃতিতে এটি ব্যবহার করুন:

# উদাহরণ:
# শুধুমাত্র 'free' উপস্থিত থাকলেই প্রিন্ট করুন:
txt = "The best things in life are free!"
if "free" in txt:
  print("Yes, 'free' is present.")

# না হলে পরীক্ষা করুন
# কোনো স্ট্রিং-এ কোনো নির্দিষ্ট শব্দগুচ্ছ বা অক্ষর নেই কি না, তা পরীক্ষা করতে আমরা `@` কীওয়ার্ডটি ব্যবহার করতে পারি not in।

# উদাহরণ:
# নিচের লেখাটিতে "expensive" শব্দটি আছে কি না তা যাচাই করুন:
txt = "The best things in life are free!"
print("expensive" not in txt)

#  একটি ifবিবৃতিতে এটি ব্যবহার করুন:

# উদাহরণ:
# শুধুমাত্র তখনই প্রিন্ট করুন যখন "expensive" শব্দটি উপস্থিত থাকবে না:
txt = "The best things in life are free!"
if "expensive" not in txt:
  print("No, 'expensive' is NOT present.")

