mylist = ["apple", "banana", "cherry"]

# একটিমাত্র ভেরিয়েবলে একাধিক আইটেম সংরক্ষণ করতে লিস্ট ব্যবহার করা হয়।

# লিস্ট হলো পাইথনের ৪টি বিল্ট-ইন ডেটা টাইপের মধ্যে একটি, যা ডেটার সংগ্রহ সংরক্ষণ করতে ব্যবহৃত হয়। অন্য ৩টি হলো টাপল , সেট এবং ডিকশনারি , যাদের প্রত্যেকের আলাদা বৈশিষ্ট্য এবং ব্যবহার রয়েছে।

# বর্গাকার বন্ধনী ব্যবহার করে তালিকা তৈরি করা হয়:
# উদাহরণ
# একটি তালিকা তৈরি করুন:

thislist = ["apple", "banana", "cherry"]
print(thislist)

"""
তালিকার আইটেম
তালিকার আইটেমগুলো ক্রমানুসারে সাজানো, পরিবর্তনযোগ্য এবং এতে একই মান একাধিকবার ব্যবহার করা যায়।

তালিকার আইটেমগুলো সূচীবদ্ধ করা থাকে, প্রথম আইটেমটির একটি সূচক থাকে [0], দ্বিতীয় আইটেমটির একটি সূচক থাকে [1]ইত্যাদি।

যখন আমরা বলি যে তালিকাগুলো ক্রমবদ্ধ, তার মানে হলো তালিকাগুলোর একটি নির্দিষ্ট ক্রম রয়েছে এবং সেই ক্রম পরিবর্তন হবে না।

যদি আপনি কোনো তালিকায় নতুন আইটেম যোগ করেন, তাহলে নতুন আইটেমগুলো তালিকার শেষে যুক্ত হবে।

দ্রষ্টব্য: তালিকার কিছু মেথড আছে যা ক্রম পরিবর্তন করবে, কিন্তু সাধারণভাবে: আইটেমগুলোর ক্রম পরিবর্তন হবে না।

পরিবর্তনযোগ্য
তালিকাটি পরিবর্তনযোগ্য, অর্থাৎ তালিকাটি তৈরি করার পরেও আমরা এর মধ্যে থাকা আইটেমগুলো পরিবর্তন, যোগ এবং অপসারণ করতে পারি।

ডুপ্লিকেটের অনুমতি দিন
যেহেতু তালিকাগুলো সূচীবদ্ধ, তাই তালিকায় একই মানের আইটেম থাকতে পারে:
"""
# উদাহরণ
# তালিকায় সদৃশ মান অনুমোদিত:

thislist = ["apple", "banana", "cherry", "apple", "cherry"]
print(thislist)

"""
তালিকার দৈর্ঘ্য
একটি লিস্টে কতগুলো আইটেম আছে তা নির্ধারণ করতে, এই len()ফাংশনটি ব্যবহার করুন:
"""
# উদাহরণ
# তালিকায় থাকা আইটেমের সংখ্যা প্রিন্ট করুন:

thislist = ["apple", "banana", "cherry"]
print(len(thislist))

"""
তালিকার আইটেম - ডেটা টাইপ
তালিকার আইটেমগুলো যেকোনো ডেটা টাইপের হতে পারে:
"""
# উদাহরণ
# স্ট্রিং, ইন্ট এবং বুলিয়ান ডেটা টাইপ:

list1 = ["apple", "banana", "cherry"]
list2 = [1, 5, 7, 9, 3]
list3 = [True, False, False]

# একটি তালিকায় বিভিন্ন ধরনের ডেটা থাকতে পারে:

# উদাহরণ
# স্ট্রিং, পূর্ণসংখ্যা এবং বুলিয়ান মান সহ একটি তালিকা:

list1 = ["abc", 34, True, 40, "male"]

"""
টাইপ()
পাইথনের দৃষ্টিকোণ থেকে, লিস্টকে 'list' ডেটা টাইপের অবজেক্ট হিসেবে সংজ্ঞায়িত করা হয়:
<class 'list'>
"""
# উদাহরণ
# লিস্টের ডেটা টাইপ কী?

mylist = ["apple", "banana", "cherry"]
print(type(mylist))

"""
list() কনস্ট্রাক্টর
নতুন লিস্ট তৈরি করার সময়ও list() কনস্ট্রাক্টর ব্যবহার করা সম্ভব ।
"""
# উদাহরণ
# কনস্ট্রাক্টর ব্যবহার করে list()একটি লিস্ট তৈরি করা:

thislist = list(("apple", "banana", "cherry")) # note the double round-brackets
print(thislist)

"""
পাইথন কালেকশন (অ্যারে)
পাইথন প্রোগ্রামিং ভাষায় চার ধরনের কালেকশন ডেটা টাইপ রয়েছে:

লিস্ট - হলো একটি সংগ্রহ যা ক্রমবদ্ধ এবং পরিবর্তনযোগ্য। এতে একাধিক সদস্য থাকতে পারে।

টাপল - হলো একটি ক্রমবদ্ধ ও অপরিবর্তনশীল সংকলন। এতে একাধিক সদস্য থাকতে পারে।

সেট - হলো এমন একটি সংগ্রহ যা অক্রমবদ্ধ, অপরিবর্তনশীল* এবং অসূচীকৃত। এর কোনো সদৃশ সদস্য নেই।

অভিধান - হলো একটি সংগ্রহ যা সুশৃঙ্খল** এবং পরিবর্তনযোগ্য। এতে কোনো সদৃশ সদস্য নেই।
"""


# সেটের আইটেমগুলো অপরিবর্তনীয়, কিন্তু আপনি যখন খুশি আইটেম সরাতে এবং/অথবা যোগ করতে পারেন।

# পাইথন সংস্করণ ৩.৭ থেকে ডিকশনারিগুলো ক্রমবদ্ধ (ordered )। পাইথন ৩.৬ এবং তার পূর্ববর্তী সংস্করণগুলোতে ডিকশনারিগুলো অক্রমবদ্ধ (unordered )।

# সংগ্রহের ধরণ নির্বাচন করার সময়, সেই ধরণের বৈশিষ্ট্যগুলো বোঝা সহায়ক। একটি নির্দিষ্ট ডেটা সেটের জন্য সঠিক ধরণ নির্বাচন করার অর্থ হতে পারে অর্থের অক্ষুণ্ণতা, এবং এর ফলে কার্যকারিতা বা নিরাপত্তাও বৃদ্ধি পেতে পারে।
