# আইটেমগুলিতে অ্যাক্সেস করুন
"""
তালিকার আইটেমগুলো সূচীবদ্ধ করা আছে এবং আপনি সূচক নম্বর ব্যবহার করে সেগুলোতে প্রবেশ করতে পারেন:
"""
# উদাহরণ
# তালিকার দ্বিতীয় আইটেমটি প্রিন্ট করুন:

thislist = ["apple", "banana", "cherry"]
print(thislist[1])

# নেতিবাচক সূচীকরণ
"""
নেগেটিভ ইনডেক্সিং মানে শেষ থেকে শুরু করা।

-1শেষ আইটেমটিকে বোঝায়, -2শেষের আগের আইটেমটিকে বোঝায় ইত্যাদি।
"""
# উদাহরণ
# তালিকার শেষ আইটেমটি প্রিন্ট করুন:

thislist = ["apple", "banana", "cherry"]
print(thislist[-1])

# সূচকের পরিসর
"""
রেঞ্জটি কোথা থেকে শুরু হবে এবং কোথায় শেষ হবে তা নির্দিষ্ট করে আপনি ইনডেক্সের একটি পরিসর নির্দিষ্ট করতে পারেন।

কোনো পরিসর নির্দিষ্ট করলে, ফেরত আসা মানটি হবে নির্দিষ্ট আইটেমগুলোসহ একটি নতুন তালিকা।
"""
# উদাহরণ
# তৃতীয়, চতুর্থ এবং পঞ্চম আইটেমটি ফেরত দিন:

thislist = ["apple", "banana", "cherry", "orange", "kiwi", "melon", "mango"]
print(thislist[2:5])

# দ্রষ্টব্য: অনুসন্ধানটি সূচক ২ (অন্তর্ভুক্ত) থেকে শুরু হয়ে সূচক ৫ (অন্তর্ভুক্ত নয়)-এ শেষ হবে।

# মনে রাখবেন যে প্রথম আইটেমটির সূচক ০।

# প্রারম্ভিক মান বাদ দিলে, পরিসরটি প্রথম আইটেম থেকে শুরু হবে:

# উদাহরণ
# এই উদাহরণটি শুরু থেকে 'kiwi' পর্যন্ত, কিন্তু 'kiwi' অন্তর্ভুক্ত না করে, আইটেমগুলো ফেরত দেয়:

thislist = ["apple", "banana", "cherry", "orange", "kiwi", "melon", "mango"]
print(thislist[:4])

# শেষ মানটি বাদ দিলে, পরিসরটি তালিকার শেষ পর্যন্ত চলতে থাকবে:

# উদাহরণ
# এই উদাহরণটি 'চেরি' থেকে শেষ পর্যন্ত আইটেমগুলো ফেরত দেয়:

thislist = ["apple", "banana", "cherry", "orange", "kiwi", "melon", "mango"]
print(thislist[2:])

# নেতিবাচক সূচকের পরিসর
"""
তালিকার শেষ থেকে অনুসন্ধান শুরু করতে চাইলে নেগেটিভ ইনডেক্স উল্লেখ করুন:
"""
# উদাহরণ
# এই উদাহরণটি "কমলা" (-4) থেকে "আম" (-1) পর্যন্ত আইটেমগুলি ফেরত দেয়, কিন্তু "আম" অন্তর্ভুক্ত করে না:

thislist = ["apple", "banana", "cherry", "orange", "kiwi", "melon", "mango"]
print(thislist[-4:-1])

# আইটেমটি বিদ্যমান কিনা তা পরীক্ষা করুন
"""
তালিকায় কোনো নির্দিষ্ট আইটেম আছে কিনা তা জানতে in কীওয়ার্ডটি ব্যবহার করুন:
"""
# উদাহরণ
# তালিকায় 'apple' আছে কিনা তা পরীক্ষা করুন:

thislist = ["apple", "banana", "cherry"]
if "apple" in thislist:
  print("Yes, 'apple' is in the fruits list")
