""" কোনো নির্দিষ্ট আইটেমের মান পরিবর্তন করতে, সূচক নম্বরটি দেখুন: """

# উদাহরণ
# দ্বিতীয় আইটেমটি পরিবর্তন করুন:

thislist = ["apple", "banana", "cherry"]
thislist[1] = "blackcurrant"
print(thislist)

# আইটেমের মানগুলির একটি পরিসর পরিবর্তন করুন

# একটি নির্দিষ্ট পরিসরের মধ্যে থাকা আইটেমগুলির মান পরিবর্তন করতে, নতুন মানগুলি সহ একটি তালিকা সংজ্ঞায়িত করুন এবং সেই সূচক নম্বরের পরিসরটি উল্লেখ করুন যেখানে আপনি নতুন মানগুলি সন্নিবেশ করতে চান:

# উদাহরণ
# 'banana' এবং 'cherry' মান দুটিকে 'blackcurrant' এবং 'watermelon' মান দিয়ে পরিবর্তন করুন:

thislist = ["apple", "banana", "cherry", "orange", "kiwi", "mango"]
thislist[1:3] = ["blackcurrant", "watermelon"]
print(thislist)

# আইটেমের মানগুলির একটি পরিসর পরিবর্তন করুন:

""" একটি নির্দিষ্ট পরিসরের মধ্যে থাকা আইটেমগুলির মান পরিবর্তন করতে, নতুন মানগুলি সহ একটি তালিকা সংজ্ঞায়িত করুন এবং সেই সূচক নম্বরের পরিসরটি উল্লেখ করুন যেখানে আপনি নতুন মানগুলি সন্নিবেশ করতে চান: """

# উদাহরণ
# 'banana' এবং 'cherry' মান দুটিকে 'blackcurrant' এবং 'watermelon' মান দিয়ে পরিবর্তন করুন:

thislist = ["apple", "banana", "cherry", "orange", "kiwi", "mango"]
thislist[1:3] = ["blackcurrant", "watermelon"]
print(thislist)

""" আপনি যদি প্রতিস্থাপন করার চেয়ে বেশি আইটেম যোগ করেন, তাহলে নতুন আইটেমগুলো আপনার নির্দিষ্ট করা স্থানে যুক্ত হবে এবং বাকি আইটেমগুলো সেই অনুযায়ী স্থানান্তরিত হবে: """

# উদাহরণ
# দ্বিতীয় মানটিকে দুটি নতুন মান দিয়ে প্রতিস্থাপন করে পরিবর্তন করুন:

thislist = ["apple", "banana", "cherry"]
thislist[1:2] = ["blackcurrant", "watermelon"]
print(thislist)

# দ্রষ্টব্য: সন্নিবেশিত আইটেমের সংখ্যা প্রতিস্থাপিত আইটেমের সংখ্যার সাথে না মিললে তালিকার দৈর্ঘ্য পরিবর্তিত হবে।

""" আপনি যদি প্রতিস্থাপন করার চেয়ে কম আইটেম যোগ করেন, তাহলে নতুন আইটেমগুলো আপনার নির্দিষ্ট করা স্থানে যোগ করা হবে এবং বাকি আইটেমগুলো সেই অনুযায়ী স্থানান্তরিত হবে: """

# উদাহরণ
# দ্বিতীয় এবং তৃতীয় মানটিকে একটি মান দিয়ে প্রতিস্থাপন করে পরিবর্তন করুন:

thislist = ["apple", "banana", "cherry"]
thislist[1:3] = ["watermelon"]
print(thislist)

# আইটেম ঢোকান
# বিদ্যমান কোনো মান প্রতিস্থাপন না করে তালিকায় একটি নতুন আইটেম যোগ করতে, আমরা এই insert()পদ্ধতিটি ব্যবহার করতে পারি।

# এই insert()পদ্ধতিটি নির্দিষ্ট ইন্ডেক্সে একটি আইটেম সন্নিবেশ করে:

# উদাহরণ
# তৃতীয় আইটেম হিসেবে 'তরমুজ' যোগ করুন:

thislist = ["apple", "banana", "cherry"]
thislist.insert(2, "watermelon")
print(thislist)

# দ্রষ্টব্য: উপরের উদাহরণটির ফলে, তালিকাটিতে এখন ৪টি আইটেম থাকবে।

