""" আপনি একটি লুপ ব্যবহার করে তালিকার আইটেমগুলোর মধ্যে দিয়ে যেতে পারেন for : """

# উদাহরণ
# তালিকার সমস্ত আইটেম এক এক করে প্রিন্ট করুন:

thislist = ["apple", "banana", "cherry"]
for x in thislist:
  print(x)

""" সূচক সংখ্যাগুলির মধ্যে দিয়ে লুপ করুন
আপনি তালিকার আইটেমগুলোর সূচক নম্বর উল্লেখ করে সেগুলোর মধ্যে দিয়ে চক্রাকারে ঘুরতেও পারেন। """

""" উপযুক্ত ইটারেবল তৈরি করতে ` range()and` ফাংশনগুলো ব্যবহার করুন ।  len() """

# উদাহরণ
# তাদের সূচক নম্বর উল্লেখ করে সমস্ত আইটেম প্রিন্ট করুন:

thislist = ["apple", "banana", "cherry"]
for i in range(len(thislist)):
  print(thislist[i])

# উপরের উদাহরণে তৈরি করা ইটারেবলটি হলো [0, 1, 2].

""" while লুপ ব্যবহার করে
whileআপনি একটি লুপ ব্যবহার করে তালিকার আইটেমগুলোর মধ্যে দিয়ে যেতে পারেন । """

""" ফাংশনটি ব্যবহার করে len() তালিকার দৈর্ঘ্য নির্ধারণ করুন, তারপর ০ থেকে শুরু করে আইটেমগুলোর ইন্ডেক্স উল্লেখ করে লুপ চালান। """

""" মনে রাখবেন, প্রতিটি পুনরাবৃত্তির পর সূচকটি ১ করে বাড়াতে হবে। """

# উদাহরণ
""" while একটি লুপ ব্যবহার করে সমস্ত ইনডেক্স নম্বরের মধ্য দিয়ে গিয়ে সব আইটেম প্রিন্ট করুন। """

thislist = ["apple", "banana", "cherry"]
i = 0
while i < len(thislist):
  print(thislist[i])
  i = i + 1

""" লিস্ট কম্প্রিহেনশন ব্যবহার করে লুপিং
লিস্ট কম্প্রিহেনশন লিস্টের মধ্যে লুপ চালানোর জন্য সবচেয়ে সংক্ষিপ্ত সিনট্যাক্স প্রদান করে: """

# উদাহরণ
# একটি সংক্ষিপ্ত forলুপ যা তালিকার সমস্ত আইটেম প্রিন্ট করবে:

thislist = ["apple", "banana", "cherry"]
[print(x) for x in thislist]

