# বিবৃতি:
""" কম্পিউটার প্রোগ্রাম হলো কম্পিউটারের দ্বারা নির্বাহিতব্য "নির্দেশাবলীর" একটি তালিকা।
প্রোগ্রামিং ভাষায় এই প্রোগ্রামিং নির্দেশাবলীকে স্টেটমেন্ট বলা হয় । """
# নিম্নলিখিত স্টেটমেন্টটি স্ক্রিনে "Python is fun!" লেখাটি প্রিন্ট করে:

# উদাহরণ:
print("Python is fun!")

# অনেক বিবৃতি:
""" বেশিরভাগ পাইথন প্রোগ্রামে অনেক স্টেটমেন্ট থাকে।
বিবৃতিগুলো যে ক্রমে লেখা হয়েছে, ঠিক সেই ক্রমেই এক এক করে কার্যকর করা হয়: """

# উদাহরণ:
print("Hello World!")
print("Have a good day.")
print("Learning Python is fun!")

# পাইথনে সেমিকোলন ঐচ্ছিক:
# আপনি একাধিক স্টেটমেন্টকে একটি লাইনে লিখতে পারেন, ;কিন্তু এটি খুব কমই ব্যবহৃত হয় কারণ এতে লেখা পড়া কঠিন হয়ে যায়।

# উদাহরণ:
print("Hello"); print("How are you?"); print("Bye bye!")
# তবে, যদি আপনি কোনো বিভাজক (নিউলাইন বা কমা) ছাড়া একই লাইনে দুটি স্টেটমেন্ট রাখেন ;, তাহলে পাইথন একটি এরর দেবে:

# উদাহরণ:
print("Python is fun!") print("Really!")
# ফলাফল:
# SyntaxError: invalid syntax
