# প্রিন্ট টেক্সট
# আপনি ইতিমধ্যেই শিখেছেন যে, print()টেক্সট প্রদর্শন করতে বা মান আউটপুট করতে ফাংশনটি ব্যবহার করা যায়:

# উদাহরণ:
print("Hello World!")

# আপনি print()ফাংশনটি যতবার খুশি ব্যবহার করতে পারেন। ডিফল্টরূপে, প্রতিটি কলে টেক্সট একটি নতুন লাইনে প্রিন্ট হয়:

# উদাহরণ:
print("Hello World!")
print("I am learning Python.")
print("It is awesome!")

# ডাবল কোট
# পাইথনে টেক্সট অবশ্যই কোটেশনের মধ্যে থাকতে হবে। আপনি "ডাবল কোট অথবা 'সিঙ্গেল কোট ব্যবহার করতে পারেন:

# উদাহরণ:
print("This will work!")
print('This will also work!')

# আপনি যদি টেক্সটটি কোটেশনের মধ্যে রাখতে ভুলে যান, তাহলে পাইথন একটি এরর দেবে:

# উদাহরণ:
print(This will cause an error)
# ফলাফল:
# SyntaxError: invalid syntax.

# নতুন লাইন ছাড়া প্রিন্ট করুন
# ডিফল্টরূপে, print()ফাংশনটি একটি নতুন লাইনে শেষ হয়।

# যদি আপনি একই লাইনে একাধিক শব্দ প্রিন্ট করতে চান, তাহলে এই endপ্যারামিটারটি ব্যবহার করতে পারেন:

# উদাহরণ:
print("Hello World!", end=" ")
print("I will print on the same line.")

# end=" "লক্ষ্য করুন, সহজে পড়ার সুবিধার জন্য আমরা এর পরে একটি স্পেস যোগ করি ।
