""" পাইথন মন্তব্য:
1.পাইথন কোড ব্যাখ্যা করার জন্য কমেন্ট ব্যবহার করা যেতে পারে।
2.কোডকে আরও সহজে পাঠযোগ্য করার জন্য কমেন্ট ব্যবহার করা যেতে পারে।
3.কোড পরীক্ষা করার সময় এক্সিকিউশন আটকাতে কমেন্ট ব্যবহার করা যেতে পারে। """

# একটি মন্তব্য তৈরি করা
# যেসব কমেন্ট কমা (,) দিয়ে শুরু হয় #, পাইথন সেগুলো উপেক্ষা করবে:
# উদাহরণ:
#This is a comment
print("Hello, World!")

# লাইনের শেষে কমেন্ট যোগ করা যায় এবং পাইথন লাইনের বাকি অংশ উপেক্ষা করে:
# উদাহরণ:
print("Hello, World!") #This is a comment

# কমেন্ট মানেই যে কোডের ব্যাখ্যা দেওয়া টেক্সট হতে হবে, এমন নয়; এটি পাইথনকে কোড এক্সিকিউট করা থেকে বিরত রাখতেও ব্যবহার করা যেতে পারে।
# উদাহরণ:
#print("Hello, World!")
print("Cheers, Mate!")

# মাল্টিলাইন মন্তব্য
# পাইথনে মাল্টিলাইন কমেন্টের জন্য নির্দিষ্ট কোনো সিনট্যাক্স নেই।
# একাধিক লাইনের মন্তব্য যোগ করতে আপনি #প্রতিটি লাইনের জন্য একটি ইনসার্ট করতে পারেন:

# উদাহরণ:
#This is a comment
#written in
#more than just one line
print("Hello, World!")

# অথবা, উদ্দেশ্য অনুযায়ী না হলেও, আপনি একটি মাল্টিলাইন স্ট্রিং ব্যবহার করতে পারেন।

# যেহেতু পাইথন ভেরিয়েবলে অ্যাসাইন করা হয়নি এমন স্ট্রিং লিটারেল উপেক্ষা করে, তাই আপনি আপনার কোডে একটি মাল্টিলাইন স্ট্রিং (ট্রিপল কোট) যোগ করতে পারেন এবং এর ভিতরে আপনার কমেন্ট রাখতে পারেন:

# উদাহরণ:
"""
This is a comment
written in
more than just one line
"""

'''
This is a comment
written in
more than just one line
'''
print("Hello, World!")
# যতক্ষণ পর্যন্ত স্ট্রিংটি কোনো ভেরিয়েবলে অ্যাসাইন করা না হয়, পাইথন কোডটি পড়বে, কিন্তু তারপর তা উপেক্ষা করবে, এবং এর মাধ্যমে আপনি একটি মাল্টিলাইন কমেন্ট তৈরি করে ফেলেছেন।
