""" ভেরিয়েবল
ভেরিয়েবল হলো ডেটা মান সংরক্ষণের ধারক। """

# ভেরিয়েবল তৈরি করা
# পাইথনে ভেরিয়েবল ডিক্লেয়ার করার জন্য কোনো কমান্ড নেই।

# যখনই আপনি প্রথমবার কোনো ভেরিয়েবলে মান নির্ধারণ করেন, তখনই সেটি তৈরি হয়।
# উদাহরণ:
x = 5
y = "John"
print(x)
print(y)

# ভেরিয়েবলকে কোনো নির্দিষ্ট টাইপ দিয়ে ডিক্লেয়ার করার প্রয়োজন নেই , এমনকি সেট করার পরেও সেগুলোর টাইপ পরিবর্তন হতে পারে।
# উদাহরণ:
x = 4       # x is of type int
x = "Sally" # x is now of type str
print(x)

# কাস্টিং
#যদি আপনি কোনো ভেরিয়েবলের ডেটা টাইপ নির্দিষ্ট করতে চান, তবে তা কাস্টিং (casting) এর মাধ্যমে করা যেতে পারে।
# উদাহরণ:
x = str(3)    # x will be '3'
y = int(3)    # y will be 3
z = float(3)  # z will be 3.0

# ধরণটি পান
# ফাংশনের সাহায্যে কোনো ভেরিয়েবলের ডেটা টাইপ জানা যায় type()।
# উদাহরণ:
x = 5
y = "John"
print(type(x))
print(type(y))

# এই টিউটোরিয়ালের পরবর্তী অংশে আপনি ডেটা টাইপ এবং কাস্টিং সম্পর্কে আরও জানতে পারবেন ।
# একক উদ্ধৃতি নাকি দ্বৈত উদ্ধৃতি?

# স্ট্রিং ভেরিয়েবল সিঙ্গেল অথবা ডাবল কোট ব্যবহার করে ডিক্লেয়ার করা যায়:
# উদাহরণ:
x = "John"
# is the same as
x = 'John'

# কেস-সংবেদনশীল
# ভেরিয়েবলের নাম কেস-সেনসিটিভ।

# উদাহরণ:
# এটি দুটি ভেরিয়েবল তৈরি করবে:
a = 4
A = "Sally"
#A will not overwrite a
