# ভেরিয়েবলের নাম
# একটি ভেরিয়েবলের সংক্ষিপ্ত নাম (যেমন x এবং y) অথবা আরও বর্ণনামূলক নাম (যেমন age, carname, total_volume) থাকতে পারে।

"""
পাইথন ভেরিয়েবলের নিয়মাবলী:

ভেরিয়েবলের নাম অবশ্যই একটি অক্ষর বা আন্ডারস্কোর চিহ্ন দিয়ে শুরু হতে হবে।
ভেরিয়েবলের নাম সংখ্যা দিয়ে শুরু হতে পারে না।
ভেরিয়েবলের নামে শুধুমাত্র আলফানিউমেরিক অক্ষর এবং আন্ডারস্কোর (Az, 0-9, এবং _) থাকতে পারে।
ভেরিয়েবলের নাম কেস-সেনসিটিভ (age, Age এবং AGE তিনটি ভিন্ন ভেরিয়েবল)।
ভেরিয়েবলের নাম পাইথনের কোনো কীওয়ার্ড হতে পারে না ।
"""
# উদাহরণ:
# বৈধ ভেরিয়েবলের নাম:

myvar = "John"
my_var = "John"
_my_var = "John"
myVar = "John"
MYVAR = "John"
myvar2 = "John"

# উদাহরণ:
# অবৈধ ভেরিয়েবলের নাম:

2myvar = "John"
my-var = "John"
my var = "John"

# মনে রাখবেন যে ভেরিয়েবলের নাম কেস-সেনসিটিভ হয়।

# একাধিক শব্দ ভেরিয়েবলের নাম
# একাধিক শব্দযুক্ত ভেরিয়েবলের নাম পড়তে অসুবিধা হতে পারে।

# সেগুলোকে আরও পাঠযোগ্য করে তোলার জন্য আপনি কয়েকটি কৌশল ব্যবহার করতে পারেন:

# উটের খাঁচা
# প্রথমটি ছাড়া প্রতিটি শব্দ বড় হাতের অক্ষর দিয়ে শুরু হয়:
myVariableName = "John"

# প্যাসকেল কেস
# প্রতিটি শব্দ বড় হাতের অক্ষর দিয়ে শুরু হয়:
MyVariableName = "John"

# সাপের মামলা
# প্রতিটি শব্দ একটি আন্ডারস্কোর চিহ্ন দ্বারা আলাদা করা হয়:
my_variable_name = "John"

