# একাধিক চলকের জন্য অনেক মান
# পাইথন আপনাকে এক লাইনে একাধিক ভেরিয়েবলে মান অ্যাসাইন করার সুযোগ দেয়:

# উদাহরণ:
x, y, z = "Orange", "Banana", "Cherry"
print(x)
print(y)
print(z)

# নিশ্চিত করুন যেন ভেরিয়েবলের সংখ্যা ভ্যালুর সংখ্যার সাথে মেলে, অন্যথায় আপনি একটি ত্রুটি পাবেন।

# একটি মান থেকে একাধিক ভেরিয়েবল এবং আপনি একই লাইনে একাধিক ভেরিয়েবলে একই মান নির্ধারণ করতে পারেন:

# উদাহরণ
x = y = z = "Orange"
print(x)
print(y)
print(z)

# একটি সংগ্রহ উন্মোচন করুন
# list আপনার কাছে যদি একটি অ্যারে , ইত্যাদিতে অনেকগুলো ভ্যালু থাকে, তাহলে tupleপাইথন আপনাকে সেই ভ্যালুগুলোকে ভেরিয়েবলে বের করে আনার সুযোগ দেয়। একে আনপ্যাকিং বলা হয় ।

# উদাহরণ:

fruits = ["apple", "banana", "cherry"]
x, y, z = fruits
print(x)
print(y)
print(z)


