"""
ইন্ডেন্টেশন বলতে কোড লাইনের শুরুতে থাকা ফাঁকা স্থানকে বোঝায়।
অন্যান্য প্রোগ্রামিং ভাষায় যেখানে কোডের ইন্ডেন্টেশন শুধুমাত্র পাঠযোগ্যতার জন্য করা হয়, সেখানে পাইথনে ইন্ডেন্টেশন অত্যন্ত গুরুত্বপূর্ণ।
পাইথন কোডের একটি ব্লক নির্দেশ করতে ইনডেন্টেশন ব্যবহার করে।
"""
# উদাহরণ:
if 5 > 2:
  print("Five is greater than two!")
  
# ইন্ডেন্টেশন বাদ দিলে পাইথন একটি এরর দেবে:
# উদাহরণ:
# সিনট্যাক্স ত্রুটি:
if 5 > 2:
print("Five is greater than two!")
#error

# একজন প্রোগ্রামার হিসেবে স্পেসের সংখ্যা আপনার উপর নির্ভর করে, সাধারণত চারটি ব্যবহার করা হয়, কিন্তু অন্তত একটি স্পেস থাকতেই হবে।
# উদাহরণ:
if 5 > 2:
 print("Five is greater than two!") 
if 5 > 2:
        print("Five is greater than two!") 

# কোডের একই ব্লকে আপনাকে অবশ্যই একই সংখ্যক স্পেস ব্যবহার করতে হবে, অন্যথায় পাইথন একটি ত্রুটি দেখাবে।
# উদাহরণ:
# সিনট্যাক্স ত্রুটি:
if 5 > 2:
 print("Five is greater than two!")
        print("Five is greater than two!")
#error
